{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 1, 28, 28], "input_dtype": "float32", "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "nb_row": 3, "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "name": "convolution2d_1", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "bias": true, "nb_col": 3, "b_regularizer": null, "dim_ordering": "th", "border_mode": "valid", "nb_row": 3, "activity_regularizer": null, "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"dim_ordering": "th", "name": "averagepooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "input_dim": null, "output_dim": 128, "init": "glorot_uniform", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "input_dim": null, "output_dim": 10, "init": "glorot_uniform", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_4", "trainable": true}}], "loss": "categorical_crossentropy", "sample_weight_mode": null, "keras_version": "1.0.4", "optimizer": {"rho": 0.95, "name": "Adadelta", "lr": 1.0, "epsilon": 1e-08}}