{"class_name": "Sequential", "keras_version": "1.0.3", "optimizer": {"decay": 9.999999974752427e-07, "nesterov": true, "momentum": 0.8999999761581421, "name": "SGD", "lr": 0.009999999776482582}, "sample_weight_mode": null, "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "bias": true, "W_constraint": null, "name": "convolution2d_1", "nb_filter": 32, "activation": "linear", "border_mode": "same", "nb_row": 3, "nb_col": 3, "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "th"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_2", "activation": "linear", "nb_filter": 32, "b_regularizer": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "b_constraint": null, "trainable": true, "W_regularizer": null, "dim_ordering": "th"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_3", "activation": "linear", "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "b_constraint": null, "trainable": true, "W_regularizer": null, "dim_ordering": "th"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "convolution2d_4", "activation": "linear", "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "b_constraint": null, "trainable": true, "W_regularizer": null, "dim_ordering": "th"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "dense_1", "output_dim": 512, "b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "W_constraint": null, "name": "dense_2", "output_dim": 10, "b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}], "loss": "categorical_crossentropy"}