{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"input_dtype": "float32", "name": "dense_1", "batch_input_shape": [null, 784], "activation": "linear", "input_dim": null, "trainable": true, "b_regularizer": null, "b_constraint": {"name": "MaxNorm", "m": 0, "axis": 0}, "bias": true, "output_dim": 128, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "linear", "input_dim": null, "trainable": true, "b_regularizer": null, "b_constraint": {"name": "MaxNorm", "m": 0, "axis": 0}, "bias": true, "output_dim": 128, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "activation": "linear", "input_dim": null, "trainable": true, "b_regularizer": null, "b_constraint": {"name": "MaxNorm", "m": 0, "axis": 0}, "bias": true, "output_dim": 10, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "softmax"}}]}