{"class_name": "Sequential", "keras_version": "1.0.3", "sample_weight_mode": null, "optimizer": {"lr": 0.009999999776482582, "decay": 0.0, "nesterov": false, "momentum": 0.0, "name": "SGD"}, "config": [{"class_name": "SpikeConv2DReLU", "config": {"nb_filter": 32, "activity_regularizer": null, "subsample": [1, 1], "trainable": false, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "batch_input_shape": [100, 3, 32, 32], "b_regularizer": null, "bias": true, "nb_row": 3, "input_dtype": "float32", "name": "00Convolution2D_32x32x32", "border_mode": "same", "W_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_col": 3}}, {"class_name": "SpikeConv2DReLU", "config": {"nb_filter": 32, "activity_regularizer": null, "subsample": [1, 1], "trainable": false, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "nb_row": 3, "name": "02Convolution2D_32x32x32", "border_mode": "same", "dim_ordering": "th", "W_constraint": null, "nb_col": 3}}, {"class_name": "AvgPool2DReLU", "config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "04MaxPooling2D_32x16x16", "pool_size": [2, 2], "dim_ordering": "th"}}, {"class_name": "SpikeConv2DReLU", "config": {"nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "trainable": false, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "nb_row": 3, "name": "06Convolution2D_64x14x14", "border_mode": "valid", "dim_ordering": "th", "W_constraint": null, "nb_col": 3}}, {"class_name": "SpikeConv2DReLU", "config": {"nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "trainable": false, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "nb_row": 3, "name": "08Convolution2D_64x12x12", "border_mode": "valid", "dim_ordering": "th", "W_constraint": null, "nb_col": 3}}, {"class_name": "AvgPool2DReLU", "config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "10MaxPooling2D_64x6x6", "pool_size": [2, 2], "dim_ordering": "th"}}, {"class_name": "SpikeFlatten", "config": {"trainable": false, "name": "12Flatten_2304"}}, {"class_name": "SpikeDense", "config": {"W_regularizer": null, "trainable": false, "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "activity_regularizer": null, "name": "13Dense_512", "bias": true, "output_dim": 512, "b_constraint": null}}, {"class_name": "SpikeDense", "config": {"W_regularizer": null, "trainable": false, "b_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "activity_regularizer": null, "name": "16Dense_10", "bias": true, "output_dim": 10, "b_constraint": null}}], "loss": "categorical_crossentropy"}