{"class_name": "Sequential", "config": [{"class_name": "SpikeDense", "config": {"W_constraint": null, "b_constraint": null, "name": "00Dense_128", "output_dim": 128, "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [100, 784]}}, {"class_name": "SpikeDense", "config": {"W_constraint": null, "b_constraint": null, "name": "03Dense_128", "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}}, {"class_name": "SpikeDense", "config": {"W_constraint": null, "b_constraint": null, "name": "06Dense_10", "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 10}}]}