{"class_name": "Sequential", "config": [{"class_name": "SpikeConv2DReLU", "config": {"dim_ordering": "th", "subsample": [1, 1], "trainable": false, "input_dtype": "float32", "batch_input_shape": [100, 1, 28, 28], "W_constraint": null, "b_regularizer": null, "nb_col": 3, "name": "00Convolution2D_32x26x26", "activity_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "nb_filter": 32, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "SpikeConv2DReLU", "config": {"subsample": [1, 1], "trainable": false, "dim_ordering": "th", "W_constraint": null, "b_regularizer": null, "nb_col": 3, "name": "02Convolution2D_32x24x24", "activity_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "nb_filter": 32, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "AvgPool2DReLU", "config": {"name": "04MaxPooling2D_32x12x12", "trainable": true, "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "SpikeFlatten", "config": {"name": "06Flatten_4608", "trainable": false}}, {"class_name": "SpikeDense", "config": {"bias": true, "trainable": false, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "07Dense_128", "input_dim": null, "W_regularizer": null, "b_constraint": null, "output_dim": 128, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "SpikeDense", "config": {"bias": true, "trainable": false, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "10Dense_10", "input_dim": null, "W_regularizer": null, "b_constraint": null, "output_dim": 10, "activation": "linear", "init": "glorot_uniform"}}]}