{"config": [{"config": {"b_constraint": null, "bias": true, "nb_col": 3, "border_mode": "valid", "activation": "relu", "activity_regularizer": null, "name": "00Convolution2D_32x26x26", "W_constraint": null, "batch_input_shape": [100, 1, 28, 28], "trainable": false, "dim_ordering": "th", "init": "glorot_uniform", "input_dtype": "float32", "b_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "nb_filter": 32, "nb_row": 3}, "class_name": "SpikeConv2DReLU"}, {"config": {"b_constraint": null, "bias": true, "nb_col": 3, "border_mode": "valid", "activation": "relu", "activity_regularizer": null, "name": "02Convolution2D_32x24x24", "W_constraint": null, "b_regularizer": null, "dim_ordering": "th", "init": "glorot_uniform", "trainable": false, "subsample": [1, 1], "W_regularizer": null, "nb_filter": 32, "nb_row": 3}, "class_name": "SpikeConv2DReLU"}, {"config": {"dim_ordering": "th", "name": "04MaxPooling2D_32x12x12", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AvgPool2DReLU"}, {"config": {"trainable": false, "name": "06Flatten_4608"}, "class_name": "SpikeFlatten"}, {"config": {"b_constraint": null, "bias": true, "activation": "relu", "activity_regularizer": null, "name": "07Dense_128", "trainable": false, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 128, "W_regularizer": null, "W_constraint": null}, "class_name": "SpikeDense"}, {"config": {"b_constraint": null, "bias": true, "activation": "softmax", "activity_regularizer": null, "name": "10Dense_10", "trainable": false, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 10, "W_regularizer": null, "W_constraint": null}, "class_name": "SpikeDense"}], "loss": "categorical_crossentropy", "class_name": "Sequential", "sample_weight_mode": null, "keras_version": "1.0.4", "optimizer": {"lr": 0.009999999776482582, "decay": 0.0, "nesterov": false, "momentum": 0.0, "name": "SGD"}}