{"optimizer": {"momentum": 0.0, "decay": 0.0, "lr": 0.009999999776482582, "name": "SGD", "nesterov": false}, "keras_version": "1.0.4", "config": [{"class_name": "SpikeConv2DReLU", "config": {"W_regularizer": null, "nb_col": 3, "name": "00Convolution2D_32x26x26", "batch_input_shape": [100, 1, 28, 28], "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "input_dtype": "float32", "nb_filter": 32, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "bias": true, "activation": "relu"}}, {"class_name": "SpikeConv2DReLU", "config": {"W_regularizer": null, "nb_col": 3, "name": "02Convolution2D_32x24x24", "W_constraint": null, "subsample": [1, 1], "trainable": false, "dim_ordering": "th", "init": "glorot_uniform", "nb_row": 3, "nb_filter": 32, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "bias": true, "activation": "relu"}}, {"class_name": "AvgPool2DReLU", "config": {"pool_size": [2, 2], "name": "04MaxPooling2D_32x12x12", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "SpikeFlatten", "config": {"trainable": false, "name": "06Flatten_4608"}}, {"class_name": "SpikeDense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "07Dense_128", "W_constraint": null, "trainable": false, "output_dim": 128, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "activation": "relu"}}, {"class_name": "SpikeDense", "config": {"W_regularizer": null, "init": "glorot_uniform", "name": "10Dense_10", "W_constraint": null, "trainable": false, "output_dim": 10, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "activation": "softmax"}}], "loss": "categorical_crossentropy", "sample_weight_mode": null, "class_name": "Sequential"}