{"class_name": "Sequential", "optimizer": {"lr": 0.009999999776482582, "momentum": 0.0, "nesterov": false, "name": "SGD", "decay": 0.0}, "keras_version": "1.0.4", "sample_weight_mode": null, "loss": "categorical_crossentropy", "config": [{"class_name": "SpikeConv2DReLU", "config": {"subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 32, "bias": true, "name": "00Convolution2D_32x26x26", "trainable": false, "dim_ordering": "th", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "batch_input_shape": [100, 1, 28, 28], "border_mode": "valid", "activation": "relu", "W_regularizer": null, "nb_row": 3, "input_dtype": "float32"}}, {"class_name": "SpikeConv2DReLU", "config": {"subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 32, "name": "02Convolution2D_32x24x24", "dim_ordering": "th", "trainable": false, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "nb_col": 3, "nb_row": 3, "bias": true}}, {"class_name": "AvgPool2DReLU", "config": {"pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "name": "04MaxPooling2D_32x12x12", "trainable": true}}, {"class_name": "SpikeFlatten", "config": {"name": "06Flatten_4608", "trainable": false}}, {"class_name": "SpikeDense", "config": {"activity_regularizer": null, "activation": "relu", "output_dim": 128, "name": "07Dense_128", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "trainable": false, "b_constraint": null, "bias": true}}, {"class_name": "SpikeDense", "config": {"activity_regularizer": null, "activation": "softmax", "output_dim": 10, "name": "10Dense_10", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "trainable": false, "b_constraint": null, "bias": true}}]}