{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "W_constraint": null, "trainable": true, "activity_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "bias": true, "activation": "linear", "name": "convolution2d_1", "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "name": "convolution2d_2", "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "pool_size": [2, 2], "name": "averagepooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "name": "convolution2d_3", "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "name": "convolution2d_4", "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "pool_size": [2, 2], "name": "averagepooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "output_dim": 512, "activity_regularizer": null, "bias": true, "activation": "linear", "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "dense_1", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "output_dim": 10, "activity_regularizer": null, "bias": true, "activation": "linear", "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "name": "dense_2", "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}]}