{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "dim_ordering": "th", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "batch_input_shape": [null, 3, 32, 32], "input_dtype": "float32", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 32, "name": "convolution2d_1", "b_constraint": null, "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "dim_ordering": "th", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "name": "convolution2d_2", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "name": "averagepooling2d_1", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "dim_ordering": "th", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "name": "convolution2d_3", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "dim_ordering": "th", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "name": "convolution2d_4", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"trainable": true, "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "name": "averagepooling2d_2", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "W_constraint": null, "activation": "linear", "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "output_dim": 512, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "W_constraint": null, "activation": "linear", "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "softmax"}}], "keras_version": "1.0.7"}