{"config": [{"config": {"activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": false, "b_constraint": null, "nb_filter": 32, "input_dtype": "float32", "bias": true, "dim_ordering": "th", "W_regularizer": null, "name": "00Convolution2D_32x32x32", "nb_row": 3, "nb_col": 3, "border_mode": "same", "batch_input_shape": [100, 3, 32, 32], "subsample": [1, 1], "W_constraint": null}, "class_name": "SpikeConv2DReLU"}, {"config": {"activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "trainable": false, "b_constraint": null, "nb_filter": 32, "b_regularizer": null, "bias": true, "dim_ordering": "th", "W_regularizer": null, "name": "02Convolution2D_32x32x32", "nb_row": 3, "nb_col": 3, "border_mode": "same", "subsample": [1, 1], "W_constraint": null}, "class_name": "SpikeConv2DReLU"}, {"config": {"name": "04AveragePooling2D_32x16x16", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "class_name": "AvgPool2DReLU"}, {"config": {"activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "trainable": false, "b_constraint": null, "nb_filter": 32, "b_regularizer": null, "bias": true, "dim_ordering": "th", "W_regularizer": null, "name": "06Convolution2D_32x14x14", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "W_constraint": null}, "class_name": "SpikeConv2DReLU"}, {"config": {"activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "trainable": false, "b_constraint": null, "nb_filter": 32, "b_regularizer": null, "bias": true, "dim_ordering": "th", "W_regularizer": null, "name": "08Convolution2D_32x12x12", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "W_constraint": null}, "class_name": "SpikeConv2DReLU"}, {"config": {"name": "10AveragePooling2D_32x6x6", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "class_name": "AvgPool2DReLU"}, {"config": {"name": "12Flatten_1152", "trainable": false}, "class_name": "SpikeFlatten"}, {"config": {"activation": "relu", "init": "glorot_uniform", "trainable": false, "b_constraint": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "name": "13Dense_512", "output_dim": 512, "activity_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "SpikeDense"}, {"config": {"activation": "softmax", "init": "glorot_uniform", "trainable": false, "b_constraint": null, "b_regularizer": null, "bias": true, "W_regularizer": null, "name": "16Dense_10", "output_dim": 10, "activity_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "SpikeDense"}], "keras_version": "1.0.7", "class_name": "Sequential"}