{"class_name": "Sequential", "config": [{"class_name": "SpikeConv2DReLU", "config": {"trainable": false, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "relu", "dim_ordering": "th", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "batch_input_shape": [128, 3, 32, 32], "input_dtype": "float32", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 32, "name": "00Convolution2D_32x32x32", "b_constraint": null, "subsample": [1, 1]}}, {"class_name": "SpikeConv2DReLU", "config": {"trainable": false, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "relu", "dim_ordering": "th", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "b_constraint": null, "name": "02Convolution2D_32x32x32", "subsample": [1, 1]}}, {"class_name": "AvgPool2DReLU", "config": {"trainable": true, "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "name": "04AveragePooling2D_32x16x16", "strides": [2, 2]}}, {"class_name": "SpikeConv2DReLU", "config": {"trainable": false, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "relu", "dim_ordering": "th", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "name": "06Convolution2D_32x14x14", "subsample": [1, 1]}}, {"class_name": "SpikeConv2DReLU", "config": {"trainable": false, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "relu", "dim_ordering": "th", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "name": "08Convolution2D_32x12x12", "subsample": [1, 1]}}, {"class_name": "AvgPool2DReLU", "config": {"trainable": true, "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "name": "10AveragePooling2D_32x6x6", "strides": [2, 2]}}, {"class_name": "SpikeFlatten", "config": {"trainable": false, "name": "12Flatten_1152"}}, {"class_name": "SpikeDense", "config": {"trainable": false, "bias": true, "W_constraint": null, "activation": "relu", "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "output_dim": 512, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "13Dense_512"}}, {"class_name": "SpikeDense", "config": {"trainable": false, "bias": true, "W_constraint": null, "activation": "softmax", "W_regularizer": null, "input_dim": null, "activity_regularizer": null, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "name": "16Dense_10"}}], "keras_version": "1.0.7"}