{"config": [{"config": {"init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32", "b_constraint": null, "name": "00Convolution2D_32x32x32", "trainable": false, "batch_input_shape": [100, 3, 32, 32], "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "W_constraint": null, "dim_ordering": "th", "bias": true, "nb_filter": 32, "activation": "relu", "nb_col": 3, "subsample": [1, 1], "nb_row": 3}, "class_name": "SpikeConv2DReLU"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "trainable": false, "b_constraint": null, "name": "02Convolution2D_32x32x32", "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "W_constraint": null, "dim_ordering": "th", "bias": true, "nb_filter": 32, "activation": "relu", "nb_col": 3, "subsample": [1, 1], "nb_row": 3}, "class_name": "SpikeConv2DReLU"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th", "trainable": true, "name": "04AveragePooling2D_32x16x16"}, "class_name": "AvgPool2DReLU"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "trainable": false, "b_constraint": null, "name": "06Convolution2D_32x14x14", "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "dim_ordering": "th", "bias": true, "nb_filter": 32, "activation": "relu", "nb_col": 3, "subsample": [1, 1], "nb_row": 3}, "class_name": "SpikeConv2DReLU"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "trainable": false, "b_constraint": null, "name": "08Convolution2D_32x12x12", "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "dim_ordering": "th", "bias": true, "nb_filter": 32, "activation": "relu", "nb_col": 3, "subsample": [1, 1], "nb_row": 3}, "class_name": "SpikeConv2DReLU"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th", "trainable": true, "name": "10AveragePooling2D_32x6x6"}, "class_name": "AvgPool2DReLU"}, {"config": {"name": "12Flatten_1152", "trainable": false}, "class_name": "SpikeFlatten"}, {"config": {"output_dim": 512, "init": "glorot_uniform", "activity_regularizer": null, "trainable": false, "b_constraint": null, "name": "13Dense_512", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "activation": "relu"}, "class_name": "SpikeDense"}, {"config": {"output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "trainable": false, "b_constraint": null, "name": "16Dense_10", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "activation": "softmax"}, "class_name": "SpikeDense"}], "class_name": "Sequential", "keras_version": "1.0.7"}