{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "b_regularizer": null, "nb_col": 3, "W_constraint": null, "batch_input_shape": [null, 1, 28, 28], "input_dtype": "float32", "dim_ordering": "th", "activation": "linear", "trainable": true, "b_constraint": {"name": "MaxNorm", "m": 0, "axis": 0}, "border_mode": "valid", "name": "convolution2d_1", "subsample": [1, 1], "W_regularizer": null, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "b_regularizer": null, "nb_col": 3, "W_constraint": null, "dim_ordering": "th", "activation": "linear", "trainable": true, "b_constraint": {"name": "MaxNorm", "m": 0, "axis": 0}, "border_mode": "valid", "name": "convolution2d_2", "subsample": [1, 1], "W_regularizer": null, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": {"name": "MaxNorm", "m": 0, "axis": 0}, "trainable": true, "output_dim": 128, "W_regularizer": null, "name": "dense_1", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": {"name": "MaxNorm", "m": 0, "axis": 0}, "trainable": true, "output_dim": 10, "W_regularizer": null, "name": "dense_2", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "softmax"}}]}