{"keras_version": "1.0.6", "class_name": "Sequential", "optimizer": {"lr": 0.009999999776482582, "nesterov": false, "name": "SGD", "momentum": 0.0, "decay": 0.0}, "sample_weight_mode": null, "config": [{"config": {"bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "nb_filter": 32, "nb_row": 3, "W_constraint": null, "border_mode": "valid", "activation": "relu", "batch_input_shape": [100, 1, 28, 28], "dim_ordering": "th", "nb_col": 3, "activity_regularizer": null, "trainable": false, "name": "00Convolution2D_32x26x26", "b_constraint": null, "subsample": [1, 1], "input_dtype": "float32"}, "class_name": "SpikeConv2DReLU"}, {"config": {"bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "nb_filter": 32, "nb_row": 3, "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 3, "activity_regularizer": null, "trainable": false, "name": "02Convolution2D_32x24x24", "b_constraint": null, "subsample": [1, 1], "dim_ordering": "th"}, "class_name": "SpikeConv2DReLU"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "04MaxPooling2D_32x12x12", "border_mode": "valid", "dim_ordering": "th"}, "class_name": "AvgPool2DReLU"}, {"config": {"trainable": false, "name": "06Flatten_4608"}, "class_name": "SpikeFlatten"}, {"config": {"bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "activation": "relu", "output_dim": 128, "input_dim": null, "activity_regularizer": null, "trainable": false, "name": "07Dense_128", "W_constraint": null}, "class_name": "SpikeDense"}, {"config": {"bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "activation": "softmax", "output_dim": 10, "input_dim": null, "activity_regularizer": null, "trainable": false, "name": "10Dense_10", "W_constraint": null}, "class_name": "SpikeDense"}], "loss": "categorical_crossentropy"}